{
   "visible": [
      1
   ],
   "name": [
      "estuarine_crocodile"
   ],
   "description": [
      "estuarine crocodile,  (Crocodylus porosus), also called saltwater crocodile or saltie,  crocodile species inhabiting brackish waters of wetlands and marine intertidal environments from Sri Lanka, India, Bangladesh, and Myanmar east to the Solomon Islands and Vanuatu and south to Australia’s northern coast. The estuarine crocodile is the largest reptile in the world, and the species is known for its aggressive nature, as shown by numerous attacks on people and livestock each year.",
      "Estuarine crocodiles are the largest and heaviest of living reptiles, growing up to 7 metres (about 23 feet) long and weighing up to 1,200 kg (nearly 2,650 pounds). Most, however, range from 2.3 to 3.3 metres (about 7.5 to 10.8 feet) in length and weigh 150 to 300 kg (330 to 660 pounds). Males tend to be about one-third larger and heavier than females. Nocturnal hunters, estuarine crocodiles can consume any animal that they can capture—including people and other estuarine crocodiles. They typically prey on everything from insects, crustaceans, small reptiles, and birds up to animals the size of a water buffalo. They often emerge from below the surface of a body of water to strike at an unsuspecting victim, pulling it into the water to devour it.",
      "Females become sexually mature at about age 10–12, some five years earlier than males. After mating, a female crocodile can produce a clutch of 40–70 eggs, which she lays in a mound of rotting vegetation where the heat from the sun and the heat generated by decomposition combine to warm the eggs. She remains at the nest to defend the eggs from predators until, some 90 days later, the eggs hatch. The young crocodiles will remain with their mother until they leave her care some five weeks later. Estuarine crocodiles are thought to live for about 50 years in the wild."
   ],
   "longevity": [
      "70 years"
   ],
   "location": [
      "Southest Asia",
      "Australia",
      "Micronesia"
   ],
   "diet": [
      "mammals,birds,frogs,sharks,humans"
   ],
   "type": [
      "reptile"
   ],
   "scientificName": [
      "Crocodylus porosus"
   ],
   "habitat": [
      "wetlands"
   ],
   "related": [],
   "endangered": [
      0
   ],
   "eatingHabit": [
      "carnivorous"
   ]
}