{
   "visible": [
      1
   ],
   "name": [
      "bear"
   ],
   "diet": [
      "honey, nuts, fish, fruit, mammals"
   ],
   "longevity": [
      "20-30 years"
   ],
   "type": [
      "mammal"
   ],
   "scientificName": [
      "Ursidae"
   ],
   "description": [
      "bear,  (family Ursidae),  any of eight species of large short-tailed carnivores found in the Americas, Europe, and Asia. The sun bear (Helarctos malayanus) is the smallest, often weighing less than 50 kg (110 pounds). The largest bear is either the Kodiak bear (Ursus arctos middendorffi, a subspecies of Alaskan brown bear; see also grizzly bear) or the polar bear (Ursus maritimus), depending upon which measurements are considered; either of these bears can weigh up to 720 kg (1,600 pounds). The black bear (Ursus americanus) is common in parts of the United States and Canada.",
      "Bears are generally omnivorous, but dietary preferences range from seals for the entirely carnivorous polar bear to assorted vegetation for the largely herbivorous spectacled bear (Tremarctos ornatus). The giant panda (Ailuropoda melanoleuca) eats only bamboo. Usually gaining weight beforehand, most bears sleep fitfully through much of the winter, but they do not truly hibernate. Despite their bulk, most bears climb with ease and swim strongly.",
      "Ursids are mainly animals of northern temperate regions and are found farther north than any other mammal. The Arctic fox is found as far north on land, but the polar bear regularly roams on sea ice hundreds of kilometres from shore. Africa and Australia lack bears entirely. The spectacled bear of South America’s Andes Mountains is the only bear species that lives south of the Equator."
   ],
   "habitat": [
      "forest"
   ],
   "location": [
      "Europe",
      "United States",
      "Asia",
      "South America’s"
   ],
   "related": [
      "sun bear",
      "sun bear"
   ],
   "endangered": [
      0
   ],
   "eatingHabit": [
      "omnivorous"
   ]
}