{
   "visible": [
      1
   ],
   "name": [
      "crocodile"
   ],
   "description": [
      "crocodile,  (order Crocodylia, or Crocodilia),  any of 23 species of generally large, ponderous, amphibious animals of lizard-like appearance and carnivorous habit belonging to the reptile order Crocodylia. Crocodiles have powerful jaws with many conical teeth and short legs with clawed webbed toes. They share a unique body form that allows the eyes, ears, and nostrils to be above the water surface while most of the animal is hidden below. The tail is long and massive, and the skin is thick and plated.",
      "Crocodiles are a living link with the dinosaur-like reptiles of prehistoric times and are the nearest living relatives of the birds. A large variety of crocodilian fossils have been discovered that date back 200 million years to the Late Triassic Epoch. Fossil evidence also suggests that three major radiations occurred. Only one of the four suborders of crocodiles has survived to modern times. The order Crocodylia includes the “true crocodiles,” alligators, caimans, and gavials.",
      "Crocodiles are the largest and the heaviest of present-day reptiles. The largest representatives, the Nile crocodile (Crocodylus niloticus) of Africa and the estuarine (or saltwater) crocodile (C. porosus) of Australia, attain lengths of up to 6 metres (20 feet) and weigh over 1,000 kg (about 2,200 pounds). Some fossil forms (such as Deinosuchus and Sarcosuchus) may have been between 10 and 12 metres (33 and 40 feet) long. In comparison, the smallest species, the smooth-fronted caiman (Paleosuchus) and the dwarf crocodile (Osteolaemus tetraspis), reach about 1.7 metres (about 6 feet) in length as adults."
   ],
   "longevity": [
      "50-70 years"
   ],
   "location": [
      "Africa",
      "United-States",
      "Asia",
      "South America"
   ],
   "diet": [
      "nsects, fish, small frogs, lizards, crustaceans and small mammals"
   ],
   "type": [
      "reptile"
   ],
   "scientificName": [
      "Crocodylidae"
   ],
   "habitat": [
      "Lake",
      "River"
   ],
   "related": [
      "Nile crocodile",
      "alligators",
      "alligator",
      "gavials",
      "gavial",
      "estuarine (or saltwater) crocodile"
   ],
   "endangered": [
      1
   ],
   "eatingHabit": "carnivorous"
}