{
   "visible": [
      1
   ],
   "name": [
      "dolphin"
   ],
   "description": [
      "dolphin,  any of the toothed whales belonging to the mammal family Delphinidae (oceanic dolphins) as well as the families Platanistidae and Iniidae, the two that contain the river dolphins. Of the nearly 40 species of dolphins in the Delphinidae, 6 are commonly called whales, including the killer whale and the pilot whales. The name dolphin is also applied to members of the fish genus Coryphaena (family Coryphaenidae).",
      "Most dolphins are small, measuring less than 3 metres (10 feet) in length, and have spindle-shaped bodies, beaklike snouts (rostrums), and simple needlelike teeth. Some of these cetaceans are occasionally called porpoises, but scientists prefer to use this term as the common name for the six species in the family Phocoenidae, all of which differ from dolphins in having blunt snouts and spadelike teeth.",
      "Dolphins are popularly noted for their grace, intelligence, playfulness, and friendliness to humans. The most widely recognized species are the common and bottlenose dolphins (Delphinus delphis and Tursiops truncatus, respectively). The bottlenose, characterized by a “built-in smile” formed by the curvature of its mouth, has become a familiar performer in oceanariums. It has also become the subject of scientific studies because of its intelligence and ability to communicate by using a range of sounds and ultrasonic pulses. It adapts to captivity better than the common dolphin, which is timid. In addition, the bottlenose dolphin has the longest social memory of any nonhuman species; several members of the species were able to recognize the unique whistles of individual dolphins they once associated with at least 20 years after becoming separated from them. Bottlenose dolphins have demonstrated the ability to recognize their reflections in several experiments, suggesting a degree of self-awareness. That capability has been observed only in higher primates and a few other animal species."
   ],
   "longevity": [
      "40 years"
   ],
   "location": [
      "Asia",
      "America",
      "Europe",
      "Africa",
      "South America"
   ],
   "diet": [
      "fish,squid, jellyfish"
   ],
   "type": [
      "mammal"
   ],
   "scientificName": [
      "Delphinus"
   ],
   "habitat": [
      "Ocean",
      "Sea",
      "River"
   ],
   "related": [
      "killer whale"
   ],
   "endangered": [
      1
   ],
   "eatingHabit": [
      "carnivorous"
   ]
}