{
   "visible": [
      1
   ],
   "name": [
      "gorilla"
   ],
   "diet": [
      "leaves, shoots, stems, roots, larvae, snails, barks, rotten wood"
   ],
   "longevity": [
      "35 – 40 years"
   ],
   "type": [
      "mammal"
   ],
   "scientificName": [
      "Gorilla"
   ],
   "habitat": [
      "tropical forests",
      "rainforests"
   ],
   "location": [
      "Africa",
      "Lake Kivu",
      "Rwanda",
      "Central African Republic",
      "Democratic Republic of the Congo"
   ],
   "description": [
      "gorilla,  (genus Gorilla),  genus of primates containing the largest of the apes. The gorilla is one of the closest living relatives to humans; both groups last shared a common ancestor about 10 million years ago. Only the chimpanzee and the bonobo are closer. Gorillas live only in tropical forests of equatorial Africa. Most authorities recognize two species and four subspecies. The western gorilla (Gorilla gorilla) is made up of two subspecies: the western lowland gorilla (G. gorilla gorilla), which inhabits the lowland rainforests from Cameroon to the Congo River, and the Cross River gorilla (G. gorilla diehli), which inhabits a small forested region along the Cross River separating Nigeria from Cameroon. The eastern gorilla (G. beringei) is also made up of two subspecies: the eastern lowland, or Grauer’s, gorilla (G. beringei graueri), of the lowland rainforests of the eastern Democratic Republic of the Congo (Kinshasa), and the mountain gorilla (G. beringei beringei), found in the montane rainforests and bamboo forests of the highland terrain north and east of Lake Kivu, near the borders of Uganda, Rwanda, and Congo (Kinshasa).",
      "The gorilla is robust and powerful, with an extremely thick, strong chest and a protruding abdomen. Both skin and hair are black. The face has large nostrils, small ears, and prominent brow ridges. Adults have long, muscular arms that are 15–20 percent longer than the stocky legs. Males are about twice as heavy as females and may attain a height of about 1.7 metres (5.5 feet) and weight (in the wild) of 135–220 kg (300–485 pounds). Captive gorillas of both sexes may grow quite fat and hence become much heavier. A wild adult female typically is about 1.5 metres tall and weighs about 70–90 kg. Gorillas lack hair on the face, hands, and feet, and the chest of old males is bare. The hair of G. beringei beringei is longer than that of the other three subspecies. Adult males have a prominent crest on top of the skull and a “saddle” of gray or silver hairs on the lower part of the back—hence the term silverback, which is commonly used to refer to mature males. This saddle is much more conspicuous in eastern gorillas (G. beringei), which are jet black, than in western gorillas (G. gorilla), which are more of a deep gray-brown.",
      "Gorillas live in stable family groups numbering from 6 to 30. The groups are led by one or two (occasionally more) silverback males that are related to each other, usually a father and one or more of his sons. Occasionally brothers lead a group. The other members are females, infants, juveniles, and young adult males (blackbacks). Adult females join from outside the group, and the young are offspring of silverbacks."
   ],
   "related": [],
   "endangered": [
      1
   ],
   "eatingHabit": [
      "herbivorous"
   ]
}