{
   "visible": [
      1
   ],
   "name": [
      "rhinoceros"
   ],
   "diet": [
      "grass"
   ],
   "longevity": [
      "35-50 years"
   ],
   "location": [
      "Asia"
   ],
   "type": [
      "mammal"
   ],
   "scientificName": "Rhinocerotidae",
   "habitat": [
      "savanna",
      "grassland"
   ],
   "description": [
      "rhinoceros,  (family Rhinocerotidae), plural rhinoceroses, rhinoceros, or rhinoceri,  any of five or six species of giant horn-bearing herbivores that include some of the largest living land mammals. Only African and Asian elephants are taller at the shoulder than the two largest rhinoceros species—the white, or square-lipped, rhinoceros (Ceratotherium simum), which some divide into two species (northern white rhinoceros [C. cottoni] and southern white rhinoceros [C. simum]), and the Indian, or greater one-horned, rhinoceros (Rhinoceros unicornis). The white rhinoceros and the black rhinoceros (Diceros bicornis) live in Africa, while the Indian rhinoceros, the Javan rhinoceros (R. sondaicus), and the Sumatran rhinoceros (Dicerorhinus sumatrensis) live in Asia. The precarious state of the surviving species (all but one are endangered) is in direct contrast to the early history of this group as one of the most successful lineages of hoofed mammals. Today the total population of all the rhinoceros species combined is probably fewer than 30,000. Rhinoceroses today are restricted to eastern and southern Africa and to subtropical and tropical Asia.",
      "Rhinoceroses are characterized by the possession of one or two horns on the upper surface of the snout; these horns are not true horns but are composed of keratin, a fibrous protein found in hair. Modern rhinoceroses are large animals, ranging from 2.5 metres (8 feet) long and 1.5 metres (5 feet) high at the shoulder in the Sumatran rhinoceros to about 4 metres (13 feet) long and nearly 2 metres (7 feet) high in the white rhinoceros. Adults of larger species weigh 3–5 tons. Rhinoceroses are noted for their thick skin, which forms platelike folds, especially at the shoulders and thighs. All rhinos are gray or brown in colour, including the white rhinoceros, which tends to be paler than the others. Aside from the Sumatran rhinoceros, they are nearly or completely hairless, except for the tail tip and ear fringes, but some fossil species were covered with dense fur. The feet of the modern species have three short toes, tipped with broad, blunt nails.",
      "Most rhinoceroses are solitary. Individuals usually avoid each other, but the white rhinoceros lives in groups of up to 10 animals. In solitary species the home territory is crisscrossed with well-worn trails and often marked at the borders with urine and piles of dung."
   ],
   "related": [
      "tigers"
   ],
   "endangered": [
      1
   ],
   "eatingHabit": "herbivorous"
}