{
   "visible": [
      1
   ],
   "name": [
      "tarantula"
   ],
   "description": [
      "tarantula,  (family Theraphosidae),  any of numerous hairy and generally large spiders found in the southwestern United States, Mexico, and tropical America.",
      "Tarantulas are mygalomorphs (suborder Orthognatha), and thus they have jaws that move forward and down (rather than sideways and together, which is characteristic of araneomorphs [suborder Labidognatha]). Tarantulas are distinguished from other mygalomorphs by a collection of traits that include not only their size and hairiness but also their two pairs of book lungs and their three-segmented spinnerets. While the behaviour of tarantulas can vary, many make burrows in soil and feed mainly at night on insects and occasionally small frogs, toads, and mice. Theraphosids are generally harmless to humans, although they can inflict painful bites if provoked. They are often kept as pets.",
      "In the southwestern United States, species of the genus Aphonopelma can attain a body length up to 5 cm (almost 2 inches) and a leg span up to 12.5 cm (almost 5 inches). The spiders, dark in colour and sluggish in movement, have a hairy body and hairy legs. The most common member of that genus is A. californicum (Eurypelma californicum; sometimes E. californica), which is found in California, Texas, and Arizona. A 30-year life span has been recorded for one individual of that species."
   ],
   "longevity": [
      "15-25 years"
   ],
   "location": [
      "America",
      "South America",
      "Africa",
      "Asia",
      "Australia"
   ],
   "diet": [
      "insects,spiders,frogs,snakes,rats"
   ],
   "type": [
      "Artropod"
   ],
   "scientificName": [
      "Theraphosidae"
   ],
   "habitat": [
      "rainforest",
      "dessert",
      "soil"
   ],
   "related": [
      "Trap-door spider",
      "funnel-web spider"
   ],
   "endangered": [
      0
   ],
   "eatingHabit": [
      "carnivorous"
   ]
}