{
   "visible": [
      1
   ],
   "name": [
      "tiger"
   ],
   "description": [
      "tiger,  (Panthera tigris),  largest member of the cat family (Felidae), rivaled only by the lion (Panthera leo) in strength and ferocity. The tiger is endangered throughout its range, which stretches from the Russian Far East through parts of North Korea, China, India, and Southeast Asia to the Indonesian island of Sumatra. The Siberian, or Amur, tiger (P. tigris altaica) is the largest, measuring up to 4 metres (13 feet) in total length and weighing up to 300 kg (660 pounds). The Indian, or Bengal, tiger (P. tigris tigris) is the most numerous and accounts for about half of the total tiger population. Males are larger than females and may attain a shoulder height of about 1 metre and a length of about 2.2 metres, excluding a tail of about 1 metre; weight is 160–230 kg (350–500 pounds), and tigers from the south are smaller than those of the north.",
      "The Indo-Chinese (P. tigris corbetti), and Sumatran (P. tigris sumatrae) tigers are bright reddish tan, beautifully marked with dark, almost black, vertical stripes. The underparts, the inner sides of the limbs, the cheeks, and a large spot over each eye are whitish. The rare Siberian tiger has longer, softer, and paler fur. White tigers, not all of them true albinos, have occurred from time to time, almost all of them in India (see also albinism). Black tigers have been reported less frequently from the dense forests of Myanmar (Burma), Bangladesh, and eastern India. The tiger has no mane, but in old males the hair on the cheeks is rather long and spreading. Although most classifications separate the species into six subspecies, some merge subspecies or suggest that two tiger species exist, P. tigris on the mainland of Asia and P. sondaica of Java, Bali, and Sumatra.",
      "The tiger has adapted to a great variety of environments, from the Siberian taiga, where nights can be as cold as −40 °C (−40 °F), to the mangrove swamps of the Sundarbans, where the temperatures reach more than 40 °C (104 °F). Tigers haunt the ruins of buildings such as courts and temples and are at home in habitats ranging from dry grassland to rainforest. Grasslands, mixed grassland-forests, and deciduous rather than densely canopied forests support maximum population densities, as these habitats maintain the highest number of prey species. Having evolved in the temperate and subtropical forests of eastern Asia, the tiger is less tolerant of heat than other large cats, which may explain why it is an adept swimmer that appears to enjoy bathing. Under stress it may climb trees."
   ],
   "longevity": [
      "10 – 15 years"
   ],
   "location": [
      "Tigers can live in a range of environments, including the Siberian taiga, swamps, grasslands, and rainforests. They can be found anywhere from the Russian Far East to parts of North Korea, China, India, and Southwest Asia to the Indonesian island of Sumatra."
   ],
   "diet": "deer, water buffalo, antelope, and pigs",
   "type": [
      "mammal"
   ],
   "scientificName": [
      "Panthera tigris"
   ],
   "habitat": [
      "rainforest",
      "grassland",
      "deciduous"
   ],
   "related": [
      "lion"
   ],
   "endangered": [
      1
   ],
   "eatingHabit": [
      "carnivorous"
   ]
}